Revit 2023 API
InternalDefinition.ParameterGroup Property
 Id of a built-in parameter group to which the parameter defined by this definition belongs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public override BuiltInParameterGroup ParameterGroup { get; set; }
Visual Basic
Public Overrides Property ParameterGroup As BuiltInParameterGroup
	Get
	Set
Visual C++
public:
virtual property BuiltInParameterGroup ParameterGroup {
	BuiltInParameterGroup get () override;
	void set (BuiltInParameterGroup value) override;
}
Remarks
 The parameter group can be changed, but only for parameters that are not built in. In other words: Modifying the value of this property is only valid for parameter definitions whose BuiltInParameter property returns BuiltInParameter.INVALID, e.g. Global Parameters.
See Also
InternalDefinition Class
Autodesk.Revit.DB Namespace